In [1]:
import pandas as pd
import numpy as np

In [9]:
date=pd.read_csv(r'C:\Users\AmiteshOP\Downloads\orders.csv')
time=pd.read_csv('messages.csv')

In [5]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [11]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [12]:
date.isnull().sum()

date          0
product_id    0
city_id       0
orders        0
dtype: int64

## date feature engineering

In [14]:
date.head(2)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157

In [18]:
date['date'] = pd.to_datetime(df['date'])

In [20]:
# date['month']= date['date'].dt.month.astype(int)
date['day']=date['date'].dt.day.astype(int)
date['year']=date['date'].dt.year.astype(int)
date['weekday']=date['date'].dt.weekday.astype(int)
date['day_of_week']=date['date'].dt.dayofweek.astype(int)

In [43]:
date['month_name']= date['date'].dt.month_name()

In [46]:
date['week_name']=date['date'].dt.day_name()

In [48]:
date['is_weekend']=np.where(date['week_name'].isin(['sunday','saturday']),1,0)

In [49]:
date.head(3)

,date,product_id,city_id,orders,month,day,year,weekday,day_of_week,month_name,week_name,is_weekend
0,2019-12-10,5628,25,3,12,10,2019,1,1,December,Tuesday,0
1,2018-08-15,3646,14,157,8,15,2018,2,2,August,Wednesday,0
2,2018-10-23,1859,25,1,10,23,2018,1,1,October,Tuesday,0

In [23]:
date['day_of_week'].unique()

array([1, 2, 5, 6, 3, 4, 0])

# time

In [24]:
time.head(2)

                  date                                               msg
0  2013-12-15 00:50:00                          ищу на сегодня мужика 37
1  2014-04-29 23:40:00  ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826

In [31]:
time['time']=time['date'].apply(lambda x:x.split(' ')[-1])

In [35]:
time['date']=time['date'].apply(lambda x:x.split(' ')[0])

In [36]:
time.head(2)

         date                                               msg      time
0  2013-12-15                          ищу на сегодня мужика 37  00:50:00
1  2014-04-29  ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826  23:40:00

In [38]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
 2   time    1000 non-null   object
dtypes: object(3)
memory usage: 23.6+ KB

In [39]:
time['time']= pd.to_datetime(time['time'])
time['date']= pd.to_datetime(time['date'])

In [40]:
time['min']=time['time'].dt.minute.astype(int)
time['hrs']=time['time'].dt.hour.astype(int)
time['sec']=time['time'].dt.second.astype(int)

In [41]:
time.head(2)

,date,msg,time,min,hrs,sec
0,2013-12-15,ищу на сегодня мужика 37,2023-01-13 00:50:00,50,0,0
1,2014-04-29,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,2023-01-13 23:40:00,40,23,0

# extract time b/w dates

In [50]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2023, 1, 13, 23, 14, 40, 874241)

In [54]:
(today - date['date']).dt.days

0      1130
1      1612
2      1543
3      1245
4      1468
       ...
995    1558
996    1499
997    1347
998    1412
999    1186
Name: date, Length: 1000, dtype: int64